{
    "Matematika": {
        "Derivace": "Derivace je základní operace v diferenciálním počtu. Derivace funkce f(x) v bodě x se označuje f'(x) nebo df/dx. Geometrický význam derivace je směrnice tečny ke grafu funkce v daném bodě. Pravidla pro počítání derivací: 1) Derivace konstanty je 0, 2) Derivace mocninné funkce x^n je n*x^(n-1), 3) Derivace součtu je součet derivací, 4) Derivace součinu: (uv)' = u'v + uv', 5) Derivace podílu: (u/v)' = (u'v - uv')/v^2. Základní derivace: sin(x)' = cos(x), cos(x)' = -sin(x), e^x' = e^x, ln(x)' = 1/x. Aplikace derivací zahrnují hledání extrémů funkcí, vyšetřování průběhu funkcí a řešení optimalizačních úloh.",
        "Integrály": "Integrál je obrácená operace k derivování. Rozlišujemy neurčitý integrál ∫f(x)dx = F(x) + C a určitý integrál ∫[a,b]f(x)dx. Geometrický význam určitého integrálu je obsah plochy pod křivkou. Základní pravidla: 1) ∫x^n dx = x^(n+1)/(n+1) + C pro n≠-1, 2) ∫1/x dx = ln|x| + C, 3) ∫e^x dx = e^x + C, 4) ∫sin(x)dx = -cos(x) + C, 5) ∫cos(x)dx = sin(x) + C. Newton-Leibnizova formula: ∫[a,b]f(x)dx = F(b) - F(a). Metody integrace zahrnují substituci, per partes a parciální zlomky. Aplikace integrálů: výpočet obsahů, objemů, délky křivky a fyzikálních veličin."
    },
    "Čeština": {
        "Sloh": "Sloh je písemný nebo ústní projev, který má určitou formu a účel. Základní slohové útvary: 1) Vypravování - chronologicky uspořádaný příběh s kompozicí (úvod, zápletka, vyvrcholení, rozuzlení, závěr), 2) Popis - zachycení vzhledu osoby, předmětu nebo prostoru, 3) Výklad - objektivní sdělení informací, faktů a poznatků, 4) Úvaha - subjektivní zamyšlení nad problémem. Slohové postupy: epický (vypravování), lyrický (vyjadřování citů), dramatický (dialog). Jazykové prostředky: spisovný jazyk, odborná terminologie, obrazná pojmenování, synonyma. Kompozice textu musí být logická a přehledná. Důležité je dodržování jazykové správnosti a stylistické vhodnosti.",
        "Literární směry": "Literární směry jsou proudy v literatuře s podobnými znaky. Romantismus (19. století) - důraz na city, individualismus, exotika, představitelé: K. H. Mácha, V. Hugo. Realismus (polovina 19. století) - objektivní zobrazení skutečnosti, společenská kritika, B. Němcová, G. Flaubert. Naturalismus - extrémní realismus, vliv prostředí na člověka, É. Zola. Symbolismus - symbolika, hudebnost jazyka, P. Verlaine. Moderna (přelom 19./20. století) - reakce na pozitivismus, O. Březina, A. Sova. Avantgarda (20. století) - experimentování, kubismus, futurismus, dadaismus, surrealismus. Socialismus - ideologicky angažovaná literatura. Postmoderna - hravost, intertextualita, metafikce."
    },
    "Angličtina": {
        "Present Tenses": "Present tenses in English include four forms. Present Simple: used for habits, general truths, and permanent situations. Form: I/you/we/they + verb, he/she/it + verb+s. Example: 'I work every day.' Present Continuous: used for actions happening now or temporary situations. Form: am/is/are + verb-ing. Example: 'I am working now.' Present Perfect: used for completed actions with present relevance or unfinished time periods. Form: have/has + past participle. Example: 'I have worked here for 5 years.' Present Perfect Continuous: used for actions that started in the past and continue to the present. Form: have/has + been + verb-ing. Example: 'I have been working since morning.' Time expressions: Simple (always, usually, never), Continuous (now, at the moment), Perfect (just, already, yet, since, for), Perfect Continuous (since, for, all morning).",
        "Irregular Verbs": "Irregular verbs in English don't follow the regular -ed pattern for past tense and past participle. Common irregular verbs include: be/was,were/been (být), have/had/had (mít), do/did/done (dělat), go/went/gone (jít), come/came/come (přijít), see/saw/seen (vidět), get/got/got(gotten) (dostat), make/made/made (udělat), take/took/taken (vzít), give/gave/given (dát), think/thought/thought (myslet), know/knew/known (znát), say/said/said (říci), tell/told/told (říci), find/found/found (najít), leave/left/left (odejít), feel/felt/felt (cítit), bring/brought/brought (přinést), buy/bought/bought (koupit), teach/taught/taught (učit). These verbs must be memorized as they form the foundation of English grammar and are used frequently in both spoken and written English."
    }
}